function pow(x, y) {
// Створюю змінну result, починаю з 1, бо 1 — це нейтральне число для множення
    let result = 1

// За допомогою циклу for повторюю множення x на себе y разів
    for (let i = 0; i < y; i++) {
        result = result * x;
}

// Повертається результат обчислення
return result;
}

// Тестуємо функцію:
// Наприклад, якщо піднести 5 у степінь 3 — це 5 * 5 * 5 = 125
console.log(pow(5, 3)); // Очікуваний результат: 125
// Наприклад, якщо піднести 2 у степінь 4 - це 2 * 2 * 2 * 2 = 16
console.log(pow(2, 4)); // Очікуваний результат: 16